# 过滤缺失值

dropna()

## 1. 过滤缺失值(Series)

In [1]:
import numpy as np
import pandas as pd

In [2]:
from numpy import nan as NA

In [3]:
data = pd.Series([1, NA, 3.5, NA, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [6]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [8]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

## 2. 过滤缺失值(DataFrame)

In [10]:
df = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                 [NA, NA, NA], [NA, 6.5, 3.]])

In [11]:
df

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [12]:
cleaned = df.dropna()

In [13]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [14]:
df.dropna(how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [18]:
df[4]=NA

In [19]:
df

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [21]:
df.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

## 过滤thresh

In [24]:
df2 = pd.DataFrame(np.random.randn(7, 3))

In [27]:
df2.iloc[:4, 1] = NA

In [28]:
df2.iloc[:2, 2] = NA

In [30]:
df2.iloc[:1, 0] = NA

In [35]:
df2

          0         1         2
0       NaN       NaN       NaN
1 -1.431415       NaN       NaN
2 -0.490505       NaN -0.972433
3 -0.010548       NaN -0.851187
4  0.740992  0.507384 -0.312183
5 -1.043333 -0.404996  0.870679
6 -0.392122  0.139708  0.877711

In [32]:
df2.dropna()

          0         1         2
4  0.740992  0.507384 -0.312183
5 -1.043333 -0.404996  0.870679
6 -0.392122  0.139708  0.877711

In [34]:
df2.dropna(thresh=2)

          0         1         2
2 -0.490505       NaN -0.972433
3 -0.010548       NaN -0.851187
4  0.740992  0.507384 -0.312183
5 -1.043333 -0.404996  0.870679
6 -0.392122  0.139708  0.877711

In [36]:
df2.dropna(thresh=3)

          0         1         2
4  0.740992  0.507384 -0.312183
5 -1.043333 -0.404996  0.870679
6 -0.392122  0.139708  0.877711

In [37]:
df2.dropna(thresh=1)

          0         1         2
1 -1.431415       NaN       NaN
2 -0.490505       NaN -0.972433
3 -0.010548       NaN -0.851187
4  0.740992  0.507384 -0.312183
5 -1.043333 -0.404996  0.870679
6 -0.392122  0.139708  0.877711